Австралия/src/Catalogs/EarningAndDeductionTypes/EarningAndDeductionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>EarningAndDeductionTypes</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>InterestOnLoan</name>
      <description>Interest on loan</description>
    </items>
    <items>
      <name>PieceRatePay</name>
      <description>Piece-rate pay</description>
    </items>
    <items>
      <name>PieceRatePayFixedAmount</name>
      <description>Piece-rate pay (fixed amount)</description>
    </items>
    <items>
      <name>PieceRatePayPercent</name>
      <description>Piece-rate pay (percent)</description>
    </items>
    <items>
      <name>RepaymentOfLoanFromSalary</name>
      <description>Repayment of loan from salary</description>
    </items>
  </predefined>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.EarningAndDeductionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>GLExpenseAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Formula</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxKind</name>
    <type>
      <types>CatalogRef.TaxTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomeAndExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Enums/EarningAndDeductionTypes/EarningAndDeductionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>EarningAndDeductionTypes</name>
  <enumValues>
    <name>Earning</name>
  </enumValues>
  <enumValues>
    <name>Deduction</name>
  </enumValues>
  <enumValues>
    <name>Tax</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/DefaultGLAccounts/DefaultGLAccounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>DefaultGLAccounts</name>
  <predefined>
    <items>
      <name>AccountsPayable</name>
      <description>Accounts payable</description>
    </items>
    <items>
      <name>AccountsReceivable</name>
      <description>Accounts receivable</description>
    </items>
    <items>
      <name>AdvanceHolders</name>
      <description>Advance holders</description>
    </items>
    <items>
      <name>AdvanceHoldersPayable</name>
      <description>Advance holders payable</description>
    </items>
    <items>
      <name>AdvancesToSuppliers</name>
      <description>Advances to suppliers</description>
    </items>
    <items>
      <name>BankAccount</name>
      <description>Bank account</description>
    </items>
    <items>
      <name>BankFeesCreditAccount</name>
      <description>Bank fees credit account</description>
    </items>
    <items>
      <name>BankFeesExpenseAccount</name>
      <description>Bank fees expense account</description>
    </items>
    <items>
      <name>CapitalIntroduction</name>
      <description>Capital introduction</description>
    </items>
    <items>
      <name>CashAccount</name>
      <description>Cash account</description>
    </items>
    <items>
      <name>CommissionExpensesOnLoansBorrowed</name>
      <description>Commission expenses on loans borrowed</description>
    </items>
    <items>
      <name>CommissionIncomeOnLoansLent</name>
      <description>Commission income on loans lent</description>
    </items>
    <items>
      <name>CostOfSales</name>
      <description>Cost of sales</description>
    </items>
    <items>
      <name>CreditCardSalesReceivedAtALaterDate</name>
      <description>Credit card sales received at a later date</description>
    </items>
    <items>
      <name>CustomerAdvances</name>
      <description>Customer advances</description>
    </items>
    <items>
      <name>DiscountAllowed</name>
      <description>Discount allowed</description>
    </items>
    <items>
      <name>DiscountReceived</name>
      <description>Discount received</description>
    </items>
    <items>
      <name>Expenses</name>
      <description>Expenses</description>
    </items>
    <items>
      <name>FixedAssets</name>
      <description>Fixed assets</description>
    </items>
    <items>
      <name>FixedAssetsDepreciation</name>
      <description>Fixed assets depreciation</description>
    </items>
    <items>
      <name>ForeignCurrencyExchangeGain</name>
      <description>Foreign currency exchange gain</description>
    </items>
    <items>
      <name>ForeignCurrencyExchangeLoss</name>
      <description>Foreign currency exchange loss</description>
    </items>
    <items>
      <name>FundsTransfersBeingProcessed</name>
      <description>Funds transfers being processed</description>
    </items>
    <items>
      <name>GoodsInTransit</name>
      <description>Goods in transit</description>
    </items>
    <items>
      <name>IncomeSummary</name>
      <description>Income summary</description>
    </items>
    <items>
      <name>InterestExpensesOnLoansBorrowed</name>
      <description>Interest expenses on loans borrowed</description>
    </items>
    <items>
      <name>InterestIncome</name>
      <description>Interest income</description>
    </items>
    <items>
      <name>InterestPayable</name>
      <description>Interest payable</description>
    </items>
    <items>
      <name>InterestReceivable</name>
      <description>Interest receivable</description>
    </items>
    <items>
      <name>Inventory</name>
      <description>Inventory</description>
    </items>
    <items>
      <name>LoansBorrowed</name>
      <description>Loans borrowed</description>
    </items>
    <items>
      <name>LoansLentToCounerparty</name>
      <description>Loans lent to counterparty</description>
    </items>
    <items>
      <name>LoansLentToEmployee</name>
      <description>Loans lent to employee</description>
    </items>
    <items>
      <name>OpeningBalanceEquity</name>
      <description>Opening balance equity account (to balance opening entries)</description>
    </items>
    <items>
      <name>OtherIncome</name>
      <description>Other income</description>
    </items>
    <items>
      <name>PayrollExpenses</name>
      <description>Payroll expenses</description>
    </items>
    <items>
      <name>PayrollPayable</name>
      <description>Payroll payable</description>
    </items>
    <items>
      <name>PettyCashAccount</name>
      <description>Petty cash account</description>
    </items>
    <items>
      <name>PurchaseCostDiscrepancies</name>
      <description>Purchase cost discrepancies</description>
    </items>
    <items>
      <name>RetailMarkup</name>
      <description>Retail markup for retail inventory method</description>
    </items>
    <items>
      <name>TaxPayable</name>
      <description>Tax payable</description>
    </items>
    <items>
      <name>TaxRefund</name>
      <description>Tax refund</description>
    </items>
    <items>
      <name>VATInput</name>
      <description>VAT input</description>
    </items>
    <items>
      <name>VATAdvancesToSuppliers</name>
      <description>VAT on advance payments paid to suppliers</description>
    </items>
    <items>
      <name>VATAdvancesFromCustomers</name>
      <description>VAT on advance payments received from customers</description>
    </items>
    <items>
      <name>VATOutput</name>
      <description>VAT output</description>
    </items>
    <items>
      <name>VATReverseCharge</name>
      <description>VAT reverse charge</description>
    </items>
    <items>
      <name>WorkInProgress</name>
      <description>Work-in-progress</description>
    </items>
    <items>
      <name>WriteOffOverUnderMOHToCOGS</name>
      <description>Write-off over/underallocated manufacturing overheads to COGS</description>
    </items>
  </predefined>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/EarningAndDeductionTypes/Forms/ItemForm/Module.bsl
#Region FormEventHandlers

// Event handler procedure
// OnCreateAtServer Performs initial form attribute filling.
//
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Tax			= Enums.EarningAndDeductionTypes.Tax;
	Deduction	= Enums.EarningAndDeductionTypes.Deduction;
	
	If Not Constants.UsePersonalIncomeTaxCalculation.Get() Then
		
		ItemOfList = Items.Type.ChoiceList.FindByValue(Tax);
		If ItemOfList <> Undefined Then
			
			Items.Type.ChoiceList.Delete(ItemOfList);
			
		EndIf;
		
	EndIf; 
	
	IsTax = (Object.Type = Tax);
	CommonClientServer.SetFormItemProperty(Items, "TaxKind", "Visible", IsTax);
	CommonClientServer.SetFormItemProperty(Items, "GroupFormula", "Visible", Not IsTax);
	
	If GetFunctionalOption("UseDefaultTypeOfAccounting") And Not ValueIsFilled(Object.GLExpenseAccount) Then
		OnChangeEarningKindTypelAtServer(Object.Type);
	EndIf;
	
	NativeLanguagesSupportServer.OnCreateAtServer(ThisObject, Object);
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	SetVisibleAndEnabled();
EndProcedure

// Event handler procedure NotificationProcessing
//
&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	
	If EventName = "AccountsChangedEarningAndDeductionTypes" Then
		
		Object.GLExpenseAccount = Parameter.GLExpenseAccount;
		Modified = True;
		
	EndIf;
	
EndProcedure

&AtServer
Procedure OnReadAtServer(CurrentObject)

	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)

	NativeLanguagesSupportServer.BeforeWriteAtServer(CurrentObject);
	
EndProcedure

&AtServer
Procedure AfterWriteAtServer(CurrentObject, WriteParameters)

	NativeLanguagesSupportServer.OnReadPresentationsAtServer(Object);
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

// Event handler procedure OnChange of input field LegalEntityIndividual.
//
&AtClient
Procedure TypeOnChange(Item)
	
	SetVisibleAndEnabled();
	OnChangeEarningKindTypelAtServer(Object.Type);
	
EndProcedure

&AtClient
Procedure Attachable_Open(Item, StandardProcessing)
	NativeLanguagesSupportClient.OnOpen(ThisObject, Object, Item, StandardProcessing);
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

// Procedure is called when clicking the "Edit calculation formula" buttons. 
//
&AtClient
Procedure CommandEditCalculationFormula(Command)
	
	ParametersStructure = New Structure("FormulaText", Object.Formula);
	Notification = New NotifyDescription("CommandEditFormulaOfCalculationEnd",ThisForm);
	OpenForm("Catalog.EarningAndDeductionTypes.Form.CalculationFormulaEditForm", ParametersStructure,,,,, Notification);
	
EndProcedure

&AtClient
Procedure CommandEditFormulaOfCalculationEnd(FormulaText,Parameters) Export

	If TypeOf(FormulaText) = Type("String") Then
		Object.Formula = FormulaText;
	EndIf;

EndProcedure

#EndRegion

#Region Private

// Procedure sets availability of the form items.
//
// Parameters:
//  No.
//
&AtClient
Procedure SetVisibleAndEnabled()
	
	If Object.Type = Tax Then
		
		Object.GLExpenseAccount		= Undefined;
		Items.GroupFormula.Visible	= False;
		Object.Formula				= "";
		Items.TaxKind.Visible		= True;
		
	Else
		
		Items.GroupFormula.Visible	= True;
		Items.TaxKind.Visible		= False;
		Object.TaxKind				= Undefined;
		
	EndIf;
	
EndProcedure

// Procedure sets the values dependending on the type selected
//
&AtServer
Procedure OnChangeEarningKindTypelAtServer(EarningKindType)
	
	If EarningKindType = Deduction Then
		Object.GLExpenseAccount = Catalogs.DefaultGLAccounts.GetDefaultGLAccount("PayrollExpenses");
	Else	
		Object.GLExpenseAccount = Catalogs.DefaultGLAccounts.GetDefaultGLAccount("Expenses");
	EndIf;
	
EndProcedure

#EndRegion
